## Production: load-balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 2 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cache_buster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cache_buster"  {
      ~ id      = "911250128" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:ListInvalidations",
                          - "cloudfront:GetInvalidation",
                          - "cloudfront:GetDistributionConfig",
                          - "cloudfront:GetDistribution",
                          - "cloudfront:CreateInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::472286471787:distribution/E1HX1N6D5W92G9"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_acm_certificate.wordpress_new[0] will be created
  + resource "aws_acm_certificate" "wordpress_new" {
      + arn                       = (known after apply)
      + domain_name               = "articles.canada.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "*.articles.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "articles.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.articles.canada.ca",
        ]
      + tags                      = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                  = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.wordpress_new_cloudfront[0] will be created
  + resource "aws_acm_certificate" "wordpress_new_cloudfront" {
      + arn                       = (known after apply)
      + domain_name               = "articles.canada.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "*.articles.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "articles.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.articles.canada.ca",
        ]
      + tags                      = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                  = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_cloudfront_distribution.wordpress will be updated in-place
  ~ resource "aws_cloudfront_distribution" "wordpress" {
        id                             = "E1HX1N6D5W92G9"
        tags                           = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          - response_headers_policy_id = "238d7bcf-6182-43b0-9836-a6f800ee39f5" -> null
            # (11 unchanged attributes hidden)

          ~ forwarded_values {
              ~ headers                 = [
                  + "Content-Security-Policy",
                  + "X-Content-Type-Options",
                  + "X-Frame-Options",
                  + "X-XSS-Protection",
                  + "strict-transport-security",
                    # (4 unchanged elements hidden)
                ]
                # (2 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }
        }


      ~ ordered_cache_behavior {
          - response_headers_policy_id = "238d7bcf-6182-43b0-9836-a6f800ee39f5" -> null
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
          - response_headers_policy_id = "238d7bcf-6182-43b0-9836-a6f800ee39f5" -> null
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
          - response_headers_policy_id = "b83aa12c-1bfc-48f2-9fcb-82369a433fc8" -> null
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
          - response_headers_policy_id = "b83aa12c-1bfc-48f2-9fcb-82369a433fc8" -> null
            # (12 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ ordered_cache_behavior {
          - response_headers_policy_id = "50330b56-0f5a-40b4-bc59-dbcb9f64ed36" -> null
            # (12 unchanged attributes hidden)

          ~ forwarded_values {
              ~ headers                 = [
                  + "Content-Security-Policy",
                  + "X-Content-Type-Options",
                  + "X-Frame-Options",
                  + "X-XSS-Protection",
                  + "strict-transport-security",
                    # (4 unchanged elements hidden)
                ]
                # (2 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }
        }
      ~ ordered_cache_behavior {
          - response_headers_policy_id = "50330b56-0f5a-40b4-bc59-dbcb9f64ed36" -> null
            # (12 unchanged attributes hidden)

          ~ forwarded_values {
              ~ headers                 = [
                  + "Content-Security-Policy",
                  + "X-Content-Type-Options",
                  + "X-Frame-Options",
                  + "X-XSS-Protection",
                  + "strict-transport-security",
                    # (4 unchanged elements hidden)
                ]
                # (2 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }
        }

        origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }


        # (4 unchanged blocks hidden)
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy_admin will be destroyed
  - resource "aws_cloudfront_response_headers_policy" "security_headers_policy_admin" {
      - etag = "E23ZP02F085DFQ" -> null
      - id   = "b83aa12c-1bfc-48f2-9fcb-82369a433fc8" -> null
      - name = "gc-articles-security-headers-admin" -> null

      - security_headers_config {

          - content_type_options {
              - override = true -> null
            }

          - frame_options {
              - frame_option = "SAMEORIGIN" -> null
              - override     = true -> null
            }

          - strict_transport_security {
              - access_control_max_age_sec = 31536000 -> null
              - include_subdomains         = true -> null
              - override                   = true -> null
              - preload                    = true -> null
            }

          - xss_protection {
              - mode_block = true -> null
              - override   = true -> null
              - protection = true -> null
            }
        }
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy_api will be destroyed
  - resource "aws_cloudfront_response_headers_policy" "security_headers_policy_api" {
      - etag = "E23ZP02F085DFQ" -> null
      - id   = "50330b56-0f5a-40b4-bc59-dbcb9f64ed36" -> null
      - name = "gc-articles-security-headers-api" -> null

      - security_headers_config {

          - strict_transport_security {
              - access_control_max_age_sec = 31536000 -> null
              - include_subdomains         = true -> null
              - override                   = true -> null
              - preload                    = true -> null
            }
        }
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy_frontend will be destroyed
  - resource "aws_cloudfront_response_headers_policy" "security_headers_policy_frontend" {
      - etag = "E1F83G8C2ARO7P" -> null
      - id   = "238d7bcf-6182-43b0-9836-a6f800ee39f5" -> null
      - name = "gc-articles-security-headers-frontend" -> null

      - security_headers_config {
          - content_security_policy {
              - content_security_policy = "base-uri 'self'; connect-src 'self' https://www.google-analytics.com; default-src 'self'; font-src 'self' data: https://fonts.gstatic.com https://use.fontawesome.com https://www.canada.ca; frame-src 'self' https://docs.google.com; img-src 'self' data: https://canada.ca https://wet-boew.github.io https://www.canada.ca https://secure.gravatar.com; manifest-src 'self'; media-src 'self'; object-src 'none'; script-src 'self' 'sha256-DdN0UNltr41cvBTgBr0owkshPbwM95WknOV9rvTA7pg=' 'sha256-MF5ZCDqcQxsjnFVq0T7A8bpEWUJiuO9Qx1MqSYvCwds=' 'sha256-8//zSBdstORCAlBMo1/Cig3gKc7QlPCh9QfWbRu0OjU=' 'sha256-5/P+Wb5Puz2VZQuyT0B/H3kuum7v7A2XDV17K95mm2Q=' 'sha256-Ll9Pj6gzPpETya7YXsYglTFBzjPg0sc23VG6sms7FKE=' https://ajax.googleapis.com/ajax/libs/jquery/2.2.4/jquery.js https://www.canada.ca/etc/designs/canada/wet-boew/js/wet-boew.min.js https://www.canada.ca/etc/designs/canada/wet-boew/js/theme.min.js https://www.canada.ca/etc/designs/canada/wet-boew/js/i18n/en.min.js https://www.googletagmanager.com/; style-src 'self' 'unsafe-inline' https://use.fontawesome.com https://www.canada.ca; worker-src 'none';" -> null
              - override                = true -> null
            }

          - content_type_options {
              - override = true -> null
            }

          - frame_options {
              - frame_option = "SAMEORIGIN" -> null
              - override     = true -> null
            }

          - strict_transport_security {
              - access_control_max_age_sec = 31536000 -> null
              - include_subdomains         = true -> null
              - override                   = true -> null
              - preload                    = true -> null
            }

          - xss_protection {
              - mode_block = true -> null
              - override   = true -> null
              - protection = true -> null
            }
        }
    }

  # aws_iam_policy.cache_buster will be updated in-place
  ~ resource "aws_iam_policy" "cache_buster" {
        id        = "arn:aws:iam::472286471787:policy/cache_buster"
        name      = "cache_buster"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:ListInvalidations",
                          - "cloudfront:GetInvalidation",
                          - "cloudfront:GetDistributionConfig",
                          - "cloudfront:GetDistribution",
                          - "cloudfront:CreateInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::472286471787:distribution/E1HX1N6D5W92G9"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>